In [1]:
print("hello ji ")

hello ji

In [6]:
name = "yash"
age = 18 
number = 8149806242 
print ("My name is :",name)
print ("Age",age)
print("number:",number)

My name is : yash
Age 18
number: 8149806242

data = 10
print (type(data))
data = 10.00
print(type(data))
data = (10,11,12,13)
print(type(data))
data = {10,11,12,13}
print(type(data))

data = "hello ji "
print(type(data))
data = 'hello ji'
print(type(data))

<class 'list'>

In [13]:
a= 100
b=100
sum= a+b
print("sum =",sum )

sum = 200

In [20]:
# input dedo sirji 
name= input("enter your name :")
age = input("enter your age :")
height = input("enter height : ")

print("my name is : ",name )
print("age :",age)

enter your name : yash
enter your age : 18
enter height :  5,5

my name is :  yash
age : 18

In [3]:
n1 = int (input("enter number 1 :"))
n2 = int (input("enter number 2 :"))
result = n1+ n2 
print("this is sum : ", result )

enter number 1 : 30
enter number 2 : 90

this is sum :  120

In [6]:
x=100
y=200
result = x+y 
print (result)

x=100
y=200
result = x-y 
print (result)

x=100
y=200
result = x*y 
print (result)

x=100
y=200
result = x/y   # normal divide 
print (result)

x=100
y=200
result = x//y #floor divide 
print (result)

x=100
y=200
result = x%y # modulus 
print (result)

x=100
y=200
result = x**y #exponent 
print (result)

300
-100
20000
0.5
0
100
10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000

In [12]:
#comparison operators 
print(44>43 and 44>46 )
print(44>43 or 44>46 )
print (44 != 46)
print(44>=35)
print(65<=65)

False
True
True
True
True

In [13]:
data = 100 
data= data + 200 
print (data)

300

In [16]:
#indentity operator
web = "www.codeswithyashsalvi.com"
print( "y"in web )
print( "y" not in web )

True
False

In [17]:
#membership operator
d1= "yash"
d2= "salvi"
print(d1 is d2 )
print (d1 is not d2 )

False
True

In [6]:
# if else statement 
a=1000
b=200
c=30
d=4
if a>b and a>c and a>d :
    print(a,"is the greatest number")
elif b>a and b>c and b>d :
    print(b,"is the greatest number ")
elif c>a and c>b and c>d :
    print (c,"is the greatest number ")
else :
    print (d,"is the greatest number")

1000 is the greatest number

In [7]:
a=1000
b=200
c=30
d=4
if a<b and a<c and a<d :
    print(a,"is the smallest  number")
elif b<a and b<c and b<d :
    print(b,"is the smallest  number ")
elif c<a and c<b and c<d :
    print (c,"is the smallest number ")
else :
    print (d,"is the smallest number")

4 is the smallest number

In [22]:
A = 9

if A%2==0 :
    print (A,"is EVEN number ")
else: 
    print (A,"is ODD number ")

9 is ODD number

In [2]:
# lists 
vegetables = ["okra","cauliflower","cabbage","eggplant"]
print(vegetables[2])
print(vegetables[-3])

cabbage
cauliflower

In [5]:
veggies = ["okra","cauliflower","cabbage","eggplant"]
print(veggies[0:3])
print(veggies [2:])
print(veggies [:2])

['okra', 'cauliflower', 'cabbage']
['cabbage', 'eggplant']
['okra', 'cauliflower']

In [14]:
veggies = ["okra","cauliflower","cabbage","eggplant"]
veggies.append("tomato")
print(veggies)
veggies.insert(-2,"chilli")
print(veggies)
veggies.remove("chilli")
print(veggies)

['okra', 'cauliflower', 'cabbage', 'eggplant', 'tomato']
['okra', 'cauliflower', 'cabbage', 'chilli', 'eggplant', 'tomato']
['okra', 'cauliflower', 'cabbage', 'eggplant', 'tomato']

In [44]:
veggies = ["okra","cauliflower","cabbage","eggplant"]

veggies.pop()
print(veggies )
veggies.pop()
print(veggies )

['okra', 'cauliflower', 'cabbage']
['okra', 'cauliflower']

In [46]:
veggies.clear()
print(veggies)

[]

In [47]:
list1 = [11,22,33,44]
list2 = [55,66,77,88]
result = list1 + list2
print(result)

[11, 22, 33, 44, 55, 66, 77, 88]

In [48]:
list1 = [11,22,33,44]
result = list1*2
print(result)

[11, 22, 33, 44, 11, 22, 33, 44]

In [49]:
veggies = ["okra","cauliflower","cabbage","eggplant"]
for  i in veggies :
    print(i)

okra
cauliflower
cabbage
eggplant

In [3]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\programming\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\programming\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\programming\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\programming\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\programming\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\programming\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
# create a list 
import pandas as pd 
data = [1,2,3,4,5]
s = pd.Series(data)
print(s)
s = pd.Series(data ,index = ['a','b','c','d','e'])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
data = {'name': 'john',"age": 25,"city":'new york '}
s = pd.Series(data)
print(s)

name         john
age            25
city    new york
dtype: object

In [10]:
data = [{'NAME ':'Nishant','AGE': 35,'CITY': 'new york '},{'NAME ':'john','AGE': 35,'CITY': 'new jersey '}]
df = pd.DataFrame(data )
print(df )

     NAME   AGE         CITY
0  Nishant   35    new york
1     john   35  new jersey

In [23]:
import pandas as pd
import random

# Generate sample data
names = [
    "John", "Jane", "Alice", "Bob", "Charlie", "David", "Eva", "Fay", "Grace", "Henry",
    "Ivy", "Jack", "Kathy", "Liam", "Mia", "Noah", "Olivia", "Paul", "Quincy", "Rachel",
    "Sam", "Tom", "Uma", "Vera", "Will", "Xander", "Yara", "Zane", "Anna", "Ben", "Cathy",
    "Dylan", "Emma", "Fred", "Gina", "Hank", "Isla", "James", "Kate", "Leo", "Mary", "Nina",
    "Oscar", "Penny", "Rick", "Sophie", "Tina", "Ursula", "Victor", "Walter", "Xena", "Yves"
]

cities = [
    "New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio",
    "San Diego", "Dallas", "San Jose", "Austin", "Jacksonville", "Fort Worth", "Columbus",
    "Indianapolis", "Charlotte", "Seattle", "Denver", "Washington", "Boston", "El Paso", "Nashville",
    "Detroit", "Oklahoma City", "Portland", "Las Vegas", "Memphis", "Louisville", "Baltimore",
    "Milwaukee", "Albuquerque", "Tucson", "Fresno", "Sacramento", "Kansas City", "Long Beach",
    "Mesa", "Atlanta", "Colorado Springs", "Raleigh", "Omaha", "Miami", "Cleveland", "Tulsa",
    "Bakersfield", "Aurora", "Honolulu", "Anaheim", "Santa Ana", "Riverside", "St. Louis", "Corpus Christi"
]

# Generate random data
data = []
for _ in range(50):
    name = random.choice(names)
    age = random.randint(18, 80)
    city = random.choice(cities)
    salary = random.randint(500000,1000000)
    data.append([name, age, city,salary])

# Create a DataFrame
df = pd.DataFrame(data, columns=["NAME", "AGE", "CITY","SALARY"])

# Save to CSV
df.to_csv("people_data.csv", index=False)

In [30]:
d_file = pd.read_csv('people_data.csv')
print(d_file.head())

     NAME  AGE            CITY  SALARY
0    Xena   32  Corpus Christi  954775
1  Sophie   32     Los Angeles  558508
2    Vera   45           Tulsa  659940
3   Oscar   54          Denver  699842
4    Mary   51    Philadelphia  830542

In [25]:
df = pd.DataFrame(d_file)
print(df)

      NAME  AGE              CITY  SALARY
0     Xena   32    Corpus Christi  954775
1   Sophie   32       Los Angeles  558508
2     Vera   45             Tulsa  659940
3    Oscar   54            Denver  699842
4     Mary   51      Philadelphia  830542
5     John   54            Denver  707702
6    Cathy   36         Cleveland  525078
7     Xena   35      Jacksonville  716041
8      Bob   66         Nashville  760411
9     Yves   79       Albuquerque  775982
10    Zane   53       Kansas City  568720
11    Liam   18        Washington  607076
12     Mia   64            Denver  533651
13    Noah   31       San Antonio  959533
14    Paul   72            Aurora  669756
15    Noah   78        Louisville  901868
16   David   56             Omaha  765164
17   Penny   61           Seattle  587102
18    Rick   69      Jacksonville  750769
19    Emma   79       Albuquerque  812730
20    Yves   36  Colorado Springs  846554
21   Cathy   55           Phoenix  816390
22    Vera   50        Long Beach  808640
23     Sam   39         San Diego  735119
24     Ivy   80            Fresno  683777
25  Rachel   47         Charlotte  841642
26     Bob   23           El Paso  989817
27    Mary   19           Chicago  566832
28   Henry   63           Chicago  727162
29    Will   25        Sacramento  692055
30     Sam   18         Nashville  825196
31    Paul   38       Albuquerque  737492
32  Sophie   56       Los Angeles  663523
33     Bob   76           Atlanta  734881
34    Hank   57            Tucson  831751
35  Sophie   40       San Antonio  584563
36    Vera   63        Sacramento  515166
37  Olivia   77            Tucson  784470
38     Uma   38      Indianapolis  547907
39    John   27           Detroit  505864
40  Sophie   39        Long Beach  643938
41  Xander   18      Jacksonville  818628
42   Kathy   44       Kansas City  553900
43    Noah   37            Denver  866265
44   Dylan   53         San Diego  975701
45    Paul   28           Seattle  981382
46     Leo   65             Omaha  962383
47    Emma   36       Los Angeles  607191
48    John   63            Boston  917816
49     Fay   51           Memphis  526939

In [16]:
filter_age = df [(df['AGE'] > 25 ) & (df ['AGE']< 30 )]
print(filter_age)

     NAME  AGE            CITY
25   Jane   26         Atlanta
43   Hank   29  Corpus Christi
44  James   26       Cleveland

In [34]:
print(df.dtypes)
print(df.columns)
print(df.describe)

NAME       object
AGE         int64
CITY       object
SALARY    float64
dtype: object
Index(['NAME', 'AGE', 'CITY', 'SALARY'], dtype='object')
<bound method NDFrame.describe of       NAME  AGE              CITY     SALARY
0     Xena   32    Corpus Christi  1050252.5
1   Sophie   32       Los Angeles   614358.8
2     Vera   45             Tulsa   725934.0
3    Oscar   54            Denver   769826.2
4     Mary   51      Philadelphia   913596.2
5     John   54            Denver   778472.2
6    Cathy   36         Cleveland   577585.8
7     Xena   35      Jacksonville   787645.1
8      Bob   66         Nashville   836452.1
9     Yves   79       Albuquerque   853580.2
10    Zane   53       Kansas City   625592.0
11    Liam   18        Washington   667783.6
12     Mia   64            Denver   587016.1
13    Noah   31       San Antonio  1055486.3
14    Paul   72            Aurora   736731.6
15    Noah   78        Louisville   992054.8
16   David   56             Omaha   841680.4
17   Penny   61           Seattle   645812.2
18    Rick   69      Jacksonville   825845.9
19    Emma   79       Albuquerque   894003.0
20    Yves   36  Colorado Springs   931209.4
21   Cathy   55           Phoenix   898029.0
22    Vera   50        Long Beach   889504.0
23     Sam   39         San Diego   808630.9
24     Ivy   80            Fresno   752154.7
25  Rachel   47         Charlotte   925806.2
26     Bob   23           El Paso  1088798.7
27    Mary   19           Chicago   623515.2
28   Henry   63           Chicago   799878.2
29    Will   25        Sacramento   761260.5
30     Sam   18         Nashville   907715.6
31    Paul   38       Albuquerque   811241.2
32  Sophie   56       Los Angeles   729875.3
33     Bob   76           Atlanta   808369.1
34    Hank   57            Tucson   914926.1
35  Sophie   40       San Antonio   643019.3
36    Vera   63        Sacramento   566682.6
37  Olivia   77            Tucson   862917.0
38     Uma   38      Indianapolis   602697.7
39    John   27           Detroit   556450.4
40  Sophie   39        Long Beach   708331.8
41  Xander   18      Jacksonville   900490.8
42   Kathy   44       Kansas City   609290.0
43    Noah   37            Denver   952891.5
44   Dylan   53         San Diego  1073271.1
45    Paul   28           Seattle  1079520.2
46     Leo   65             Omaha  1058621.3
47    Emma   36       Los Angeles   667910.1
48    John   63            Boston  1009597.6
49     Fay   51           Memphis   579632.9>

In [21]:
grp_city = d_file.groupby('CITY')
for city , df in grp_city :
    print(city)

print(grp_city.size())

Albuquerque
Anaheim
Atlanta
Aurora
Bakersfield
Boston
Chicago
Cleveland
Colorado Springs
Columbus
Corpus Christi
Detroit
El Paso
Fresno
Honolulu
Indianapolis
Jacksonville
Los Angeles
Louisville
Memphis
Mesa
Miami
Milwaukee
Nashville
Oklahoma City
Philadelphia
Phoenix
Portland
Raleigh
Sacramento
San Antonio
San Diego
San Jose
Santa Ana
Seattle
St. Louis
Washington
CITY
Albuquerque         1
Anaheim             1
Atlanta             2
Aurora              2
Bakersfield         1
Boston              1
Chicago             2
Cleveland           2
Colorado Springs    2
Columbus            1
Corpus Christi      1
Detroit             2
El Paso             2
Fresno              1
Honolulu            1
Indianapolis        2
Jacksonville        1
Los Angeles         2
Louisville          1
Memphis             1
Mesa                1
Miami               1
Milwaukee           2
Nashville           2
Oklahoma City       1
Philadelphia        1
Phoenix             1
Portland            1
Raleigh             2
Sacramento          1
San Antonio         1
San Diego           1
San Jose            1
Santa Ana           1
Seattle             2
St. Louis           1
Washington          1
dtype: int64

In [28]:
df['SALARY'] = df['SALARY'].apply(lambda x : x*1.1 if x > 25 else x)
print(df)

      NAME  AGE              CITY     SALARY
0     Xena   32    Corpus Christi  1050252.5
1   Sophie   32       Los Angeles   614358.8
2     Vera   45             Tulsa   725934.0
3    Oscar   54            Denver   769826.2
4     Mary   51      Philadelphia   913596.2
5     John   54            Denver   778472.2
6    Cathy   36         Cleveland   577585.8
7     Xena   35      Jacksonville   787645.1
8      Bob   66         Nashville   836452.1
9     Yves   79       Albuquerque   853580.2
10    Zane   53       Kansas City   625592.0
11    Liam   18        Washington   667783.6
12     Mia   64            Denver   587016.1
13    Noah   31       San Antonio  1055486.3
14    Paul   72            Aurora   736731.6
15    Noah   78        Louisville   992054.8
16   David   56             Omaha   841680.4
17   Penny   61           Seattle   645812.2
18    Rick   69      Jacksonville   825845.9
19    Emma   79       Albuquerque   894003.0
20    Yves   36  Colorado Springs   931209.4
21   Cathy   55           Phoenix   898029.0
22    Vera   50        Long Beach   889504.0
23     Sam   39         San Diego   808630.9
24     Ivy   80            Fresno   752154.7
25  Rachel   47         Charlotte   925806.2
26     Bob   23           El Paso  1088798.7
27    Mary   19           Chicago   623515.2
28   Henry   63           Chicago   799878.2
29    Will   25        Sacramento   761260.5
30     Sam   18         Nashville   907715.6
31    Paul   38       Albuquerque   811241.2
32  Sophie   56       Los Angeles   729875.3
33     Bob   76           Atlanta   808369.1
34    Hank   57            Tucson   914926.1
35  Sophie   40       San Antonio   643019.3
36    Vera   63        Sacramento   566682.6
37  Olivia   77            Tucson   862917.0
38     Uma   38      Indianapolis   602697.7
39    John   27           Detroit   556450.4
40  Sophie   39        Long Beach   708331.8
41  Xander   18      Jacksonville   900490.8
42   Kathy   44       Kansas City   609290.0
43    Noah   37            Denver   952891.5
44   Dylan   53         San Diego  1073271.1
45    Paul   28           Seattle  1079520.2
46     Leo   65             Omaha  1058621.3
47    Emma   36       Los Angeles   667910.1
48    John   63            Boston  1009597.6
49     Fay   51           Memphis   579632.9

In [29]:
df.to_csv('updated_data.csv',index = False )

In [2]:
%pip install matplotlib

Requirement already satisfied: matplotlib in c:\users\programming\anaconda3\lib\site-packages (3.9.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: numpy>=1.23 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (24.1)
Requirement already satisfied: pillow>=8 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (10.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\programming\anaconda3\lib\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\programming\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.